using System;
using System.Linq;

namespace WebApp2.Models.Infrastructure
{
    public static class Seed
    {
        public static void Initialize(ApplicationContext context)
        {
            if (!context.News.Any())
            {
                context.News.AddRange(
                    new New
                    {
                        Title = "iPhone 6S",
                        Text = "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия.",
                        DatePost = DateTime.Now
                    },
                    new New
                    {
                        Title = "iPhone 61",
                        Text = "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия.",
                        DatePost = DateTime.Now
                    },
                    new New
                    {
                        Title = "iPhone 62",
                        Text = "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия.",
                        DatePost = DateTime.Now
                    }
                );
                context.SaveChanges();
            }
        }
    }
}
